__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, 1)      0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, None, 16)     192         input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, None, 16)     192         input_1[0][0]                    
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, None, 16)     192         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 16)     64          conv1d_1[0][0]                   
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, None, 16)     64          conv1d_7[0][0]                   
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, None, 16)     64          conv1d_13[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_1 (MaxPooling1D)  (None, None, 16)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
max_pooling1d_4 (MaxPooling1D)  (None, None, 16)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
max_pooling1d_7 (MaxPooling1D)  (None, None, 16)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, None, 32)     3616        max_pooling1d_1[0][0]            
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, None, 32)     3616        max_pooling1d_4[0][0]            
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, None, 32)     3616        max_pooling1d_7[0][0]            
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, None, 32)     7200        conv1d_2[0][0]                   
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, None, 32)     7200        conv1d_8[0][0]                   
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, None, 32)     7200        conv1d_14[0][0]                  
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, None, 32)     128         conv1d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, None, 32)     128         conv1d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, None, 32)     128         conv1d_15[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_2 (MaxPooling1D)  (None, None, 32)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
max_pooling1d_5 (MaxPooling1D)  (None, None, 32)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling1d_8 (MaxPooling1D)  (None, None, 32)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, None, 32)     0           max_pooling1d_2[0][0]            
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, None, 32)     0           max_pooling1d_5[0][0]            
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, None, 32)     0           max_pooling1d_8[0][0]            
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, None, 64)     10304       dropout_1[0][0]                  
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, None, 64)     10304       dropout_2[0][0]                  
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, None, 64)     10304       dropout_3[0][0]                  
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, None, 64)     20544       conv1d_4[0][0]                   
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, None, 64)     20544       conv1d_10[0][0]                  
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, None, 64)     20544       conv1d_16[0][0]                  
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, None, 64)     20544       conv1d_5[0][0]                   
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, None, 64)     20544       conv1d_11[0][0]                  
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, None, 64)     20544       conv1d_17[0][0]                  
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, None, 64)     256         conv1d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, None, 64)     256         conv1d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, None, 64)     256         conv1d_18[0][0]                  
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 64)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
max_pooling1d_6 (MaxPooling1D)  (None, None, 64)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
max_pooling1d_9 (MaxPooling1D)  (None, None, 64)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, 192)    0           max_pooling1d_3[0][0]            
                                                                 max_pooling1d_6[0][0]            
                                                                 max_pooling1d_9[0][0]            
__________________________________________________________________________________________________
global_average_pooling1d_1 (Glo (None, 192)          0           concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 24)           4632        global_average_pooling1d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 192)          4800        dense_1[0][0]                    
__________________________________________________________________________________________________
reshape_1 (Reshape)             (None, 1, 192)       0           dense_2[0][0]                    
__________________________________________________________________________________________________
multiply_1 (Multiply)           (None, None, 192)    0           reshape_1[0][0]                  
                                                                 concatenate_1[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, None, 96)     18528       multiply_1[0][0]                 
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, None, 96)     0           dense_3[0][0]                    
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, None, 32)     3104        dropout_4[0][0]                  
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, None, 32)     0           dense_4[0][0]                    
__________________________________________________________________________________________________
dense_5 (Dense)                 (None, None, 1)      33          dropout_5[0][0]                  
==================================================================================================
Total params: 219,641
Trainable params: 218,969
Non-trainable params: 672
__________________________________________________________________________________________________
