__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            (None, None, 2)      0                                            
__________________________________________________________________________________________________
separable_conv1d_79 (SeparableC (None, None, 64)     224         input_4[0][0]                    
__________________________________________________________________________________________________
batch_normalization_79 (BatchNo (None, None, 64)     256         separable_conv1d_79[0][0]        
__________________________________________________________________________________________________
activation_67 (Activation)      (None, None, 64)     0           batch_normalization_79[0][0]     
__________________________________________________________________________________________________
max_pooling1d_3 (MaxPooling1D)  (None, None, 64)     0           activation_67[0][0]              
__________________________________________________________________________________________________
separable_conv1d_80 (SeparableC (None, None, 64)     4864        max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_80 (BatchNo (None, None, 64)     256         separable_conv1d_80[0][0]        
__________________________________________________________________________________________________
activation_68 (Activation)      (None, None, 64)     0           batch_normalization_80[0][0]     
__________________________________________________________________________________________________
dropout_37 (Dropout)            (None, None, 64)     0           activation_68[0][0]              
__________________________________________________________________________________________________
separable_conv1d_81 (SeparableC (None, None, 64)     4864        dropout_37[0][0]                 
__________________________________________________________________________________________________
batch_normalization_81 (BatchNo (None, None, 64)     256         separable_conv1d_81[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_33 (Gl (None, 64)           0           batch_normalization_81[0][0]     
__________________________________________________________________________________________________
dense_69 (Dense)                (None, 4)            260         global_average_pooling1d_33[0][0]
__________________________________________________________________________________________________
dense_70 (Dense)                (None, 64)           320         dense_69[0][0]                   
__________________________________________________________________________________________________
reshape_33 (Reshape)            (None, 1, 64)        0           dense_70[0][0]                   
__________________________________________________________________________________________________
multiply_33 (Multiply)          (None, None, 64)     0           reshape_33[0][0]                 
                                                                 batch_normalization_81[0][0]     
__________________________________________________________________________________________________
add_33 (Add)                    (None, None, 64)     0           multiply_33[0][0]                
                                                                 max_pooling1d_3[0][0]            
__________________________________________________________________________________________________
activation_69 (Activation)      (None, None, 64)     0           add_33[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_82 (SeparableC (None, None, 64)     4864        activation_69[0][0]              
__________________________________________________________________________________________________
batch_normalization_82 (BatchNo (None, None, 64)     256         separable_conv1d_82[0][0]        
__________________________________________________________________________________________________
activation_70 (Activation)      (None, None, 64)     0           batch_normalization_82[0][0]     
__________________________________________________________________________________________________
dropout_38 (Dropout)            (None, None, 64)     0           activation_70[0][0]              
__________________________________________________________________________________________________
separable_conv1d_83 (SeparableC (None, None, 64)     4864        dropout_38[0][0]                 
__________________________________________________________________________________________________
batch_normalization_83 (BatchNo (None, None, 64)     256         separable_conv1d_83[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_34 (Gl (None, 64)           0           batch_normalization_83[0][0]     
__________________________________________________________________________________________________
dense_71 (Dense)                (None, 4)            260         global_average_pooling1d_34[0][0]
__________________________________________________________________________________________________
dense_72 (Dense)                (None, 64)           320         dense_71[0][0]                   
__________________________________________________________________________________________________
reshape_34 (Reshape)            (None, 1, 64)        0           dense_72[0][0]                   
__________________________________________________________________________________________________
multiply_34 (Multiply)          (None, None, 64)     0           reshape_34[0][0]                 
                                                                 batch_normalization_83[0][0]     
__________________________________________________________________________________________________
add_34 (Add)                    (None, None, 64)     0           multiply_34[0][0]                
                                                                 activation_69[0][0]              
__________________________________________________________________________________________________
activation_71 (Activation)      (None, None, 64)     0           add_34[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_84 (SeparableC (None, None, 64)     4864        activation_71[0][0]              
__________________________________________________________________________________________________
batch_normalization_84 (BatchNo (None, None, 64)     256         separable_conv1d_84[0][0]        
__________________________________________________________________________________________________
activation_72 (Activation)      (None, None, 64)     0           batch_normalization_84[0][0]     
__________________________________________________________________________________________________
dropout_39 (Dropout)            (None, None, 64)     0           activation_72[0][0]              
__________________________________________________________________________________________________
separable_conv1d_85 (SeparableC (None, None, 64)     4864        dropout_39[0][0]                 
__________________________________________________________________________________________________
batch_normalization_85 (BatchNo (None, None, 64)     256         separable_conv1d_85[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_35 (Gl (None, 64)           0           batch_normalization_85[0][0]     
__________________________________________________________________________________________________
dense_73 (Dense)                (None, 4)            260         global_average_pooling1d_35[0][0]
__________________________________________________________________________________________________
dense_74 (Dense)                (None, 64)           320         dense_73[0][0]                   
__________________________________________________________________________________________________
reshape_35 (Reshape)            (None, 1, 64)        0           dense_74[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_86 (SeparableC (None, None, 64)     4224        activation_71[0][0]              
__________________________________________________________________________________________________
multiply_35 (Multiply)          (None, None, 64)     0           reshape_35[0][0]                 
                                                                 batch_normalization_85[0][0]     
__________________________________________________________________________________________________
batch_normalization_86 (BatchNo (None, None, 64)     256         separable_conv1d_86[0][0]        
__________________________________________________________________________________________________
add_35 (Add)                    (None, None, 64)     0           multiply_35[0][0]                
                                                                 batch_normalization_86[0][0]     
__________________________________________________________________________________________________
activation_73 (Activation)      (None, None, 64)     0           add_35[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_87 (SeparableC (None, None, 128)    8896        activation_73[0][0]              
__________________________________________________________________________________________________
batch_normalization_87 (BatchNo (None, None, 128)    512         separable_conv1d_87[0][0]        
__________________________________________________________________________________________________
activation_74 (Activation)      (None, None, 128)    0           batch_normalization_87[0][0]     
__________________________________________________________________________________________________
dropout_40 (Dropout)            (None, None, 128)    0           activation_74[0][0]              
__________________________________________________________________________________________________
separable_conv1d_88 (SeparableC (None, None, 128)    17664       dropout_40[0][0]                 
__________________________________________________________________________________________________
batch_normalization_88 (BatchNo (None, None, 128)    512         separable_conv1d_88[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_36 (Gl (None, 128)          0           batch_normalization_88[0][0]     
__________________________________________________________________________________________________
dense_75 (Dense)                (None, 8)            1032        global_average_pooling1d_36[0][0]
__________________________________________________________________________________________________
dense_76 (Dense)                (None, 128)          1152        dense_75[0][0]                   
__________________________________________________________________________________________________
reshape_36 (Reshape)            (None, 1, 128)       0           dense_76[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_89 (SeparableC (None, None, 128)    8384        activation_73[0][0]              
__________________________________________________________________________________________________
multiply_36 (Multiply)          (None, None, 128)    0           reshape_36[0][0]                 
                                                                 batch_normalization_88[0][0]     
__________________________________________________________________________________________________
batch_normalization_89 (BatchNo (None, None, 128)    512         separable_conv1d_89[0][0]        
__________________________________________________________________________________________________
add_36 (Add)                    (None, None, 128)    0           multiply_36[0][0]                
                                                                 batch_normalization_89[0][0]     
__________________________________________________________________________________________________
activation_75 (Activation)      (None, None, 128)    0           add_36[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_90 (SeparableC (None, None, 128)    17664       activation_75[0][0]              
__________________________________________________________________________________________________
batch_normalization_90 (BatchNo (None, None, 128)    512         separable_conv1d_90[0][0]        
__________________________________________________________________________________________________
activation_76 (Activation)      (None, None, 128)    0           batch_normalization_90[0][0]     
__________________________________________________________________________________________________
dropout_41 (Dropout)            (None, None, 128)    0           activation_76[0][0]              
__________________________________________________________________________________________________
separable_conv1d_91 (SeparableC (None, None, 128)    17664       dropout_41[0][0]                 
__________________________________________________________________________________________________
batch_normalization_91 (BatchNo (None, None, 128)    512         separable_conv1d_91[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_37 (Gl (None, 128)          0           batch_normalization_91[0][0]     
__________________________________________________________________________________________________
dense_77 (Dense)                (None, 8)            1032        global_average_pooling1d_37[0][0]
__________________________________________________________________________________________________
dense_78 (Dense)                (None, 128)          1152        dense_77[0][0]                   
__________________________________________________________________________________________________
reshape_37 (Reshape)            (None, 1, 128)       0           dense_78[0][0]                   
__________________________________________________________________________________________________
multiply_37 (Multiply)          (None, None, 128)    0           reshape_37[0][0]                 
                                                                 batch_normalization_91[0][0]     
__________________________________________________________________________________________________
add_37 (Add)                    (None, None, 128)    0           multiply_37[0][0]                
                                                                 activation_75[0][0]              
__________________________________________________________________________________________________
activation_77 (Activation)      (None, None, 128)    0           add_37[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_92 (SeparableC (None, None, 128)    17664       activation_77[0][0]              
__________________________________________________________________________________________________
batch_normalization_92 (BatchNo (None, None, 128)    512         separable_conv1d_92[0][0]        
__________________________________________________________________________________________________
activation_78 (Activation)      (None, None, 128)    0           batch_normalization_92[0][0]     
__________________________________________________________________________________________________
dropout_42 (Dropout)            (None, None, 128)    0           activation_78[0][0]              
__________________________________________________________________________________________________
separable_conv1d_93 (SeparableC (None, None, 128)    17664       dropout_42[0][0]                 
__________________________________________________________________________________________________
batch_normalization_93 (BatchNo (None, None, 128)    512         separable_conv1d_93[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_38 (Gl (None, 128)          0           batch_normalization_93[0][0]     
__________________________________________________________________________________________________
dense_79 (Dense)                (None, 8)            1032        global_average_pooling1d_38[0][0]
__________________________________________________________________________________________________
dense_80 (Dense)                (None, 128)          1152        dense_79[0][0]                   
__________________________________________________________________________________________________
reshape_38 (Reshape)            (None, 1, 128)       0           dense_80[0][0]                   
__________________________________________________________________________________________________
multiply_38 (Multiply)          (None, None, 128)    0           reshape_38[0][0]                 
                                                                 batch_normalization_93[0][0]     
__________________________________________________________________________________________________
add_38 (Add)                    (None, None, 128)    0           multiply_38[0][0]                
                                                                 activation_77[0][0]              
__________________________________________________________________________________________________
activation_79 (Activation)      (None, None, 128)    0           add_38[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_94 (SeparableC (None, None, 128)    17664       activation_79[0][0]              
__________________________________________________________________________________________________
batch_normalization_94 (BatchNo (None, None, 128)    512         separable_conv1d_94[0][0]        
__________________________________________________________________________________________________
activation_80 (Activation)      (None, None, 128)    0           batch_normalization_94[0][0]     
__________________________________________________________________________________________________
dropout_43 (Dropout)            (None, None, 128)    0           activation_80[0][0]              
__________________________________________________________________________________________________
separable_conv1d_95 (SeparableC (None, None, 128)    17664       dropout_43[0][0]                 
__________________________________________________________________________________________________
batch_normalization_95 (BatchNo (None, None, 128)    512         separable_conv1d_95[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_39 (Gl (None, 128)          0           batch_normalization_95[0][0]     
__________________________________________________________________________________________________
dense_81 (Dense)                (None, 8)            1032        global_average_pooling1d_39[0][0]
__________________________________________________________________________________________________
dense_82 (Dense)                (None, 128)          1152        dense_81[0][0]                   
__________________________________________________________________________________________________
reshape_39 (Reshape)            (None, 1, 128)       0           dense_82[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_96 (SeparableC (None, None, 128)    16640       activation_79[0][0]              
__________________________________________________________________________________________________
multiply_39 (Multiply)          (None, None, 128)    0           reshape_39[0][0]                 
                                                                 batch_normalization_95[0][0]     
__________________________________________________________________________________________________
batch_normalization_96 (BatchNo (None, None, 128)    512         separable_conv1d_96[0][0]        
__________________________________________________________________________________________________
add_39 (Add)                    (None, None, 128)    0           multiply_39[0][0]                
                                                                 batch_normalization_96[0][0]     
__________________________________________________________________________________________________
activation_81 (Activation)      (None, None, 128)    0           add_39[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_97 (SeparableC (None, None, 256)    33920       activation_81[0][0]              
__________________________________________________________________________________________________
batch_normalization_97 (BatchNo (None, None, 256)    1024        separable_conv1d_97[0][0]        
__________________________________________________________________________________________________
activation_82 (Activation)      (None, None, 256)    0           batch_normalization_97[0][0]     
__________________________________________________________________________________________________
dropout_44 (Dropout)            (None, None, 256)    0           activation_82[0][0]              
__________________________________________________________________________________________________
separable_conv1d_98 (SeparableC (None, None, 256)    67584       dropout_44[0][0]                 
__________________________________________________________________________________________________
batch_normalization_98 (BatchNo (None, None, 256)    1024        separable_conv1d_98[0][0]        
__________________________________________________________________________________________________
global_average_pooling1d_40 (Gl (None, 256)          0           batch_normalization_98[0][0]     
__________________________________________________________________________________________________
dense_83 (Dense)                (None, 16)           4112        global_average_pooling1d_40[0][0]
__________________________________________________________________________________________________
dense_84 (Dense)                (None, 256)          4352        dense_83[0][0]                   
__________________________________________________________________________________________________
reshape_40 (Reshape)            (None, 1, 256)       0           dense_84[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_99 (SeparableC (None, None, 256)    33152       activation_81[0][0]              
__________________________________________________________________________________________________
multiply_40 (Multiply)          (None, None, 256)    0           reshape_40[0][0]                 
                                                                 batch_normalization_98[0][0]     
__________________________________________________________________________________________________
batch_normalization_99 (BatchNo (None, None, 256)    1024        separable_conv1d_99[0][0]        
__________________________________________________________________________________________________
add_40 (Add)                    (None, None, 256)    0           multiply_40[0][0]                
                                                                 batch_normalization_99[0][0]     
__________________________________________________________________________________________________
activation_83 (Activation)      (None, None, 256)    0           add_40[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_100 (Separable (None, None, 256)    67584       activation_83[0][0]              
__________________________________________________________________________________________________
batch_normalization_100 (BatchN (None, None, 256)    1024        separable_conv1d_100[0][0]       
__________________________________________________________________________________________________
activation_84 (Activation)      (None, None, 256)    0           batch_normalization_100[0][0]    
__________________________________________________________________________________________________
dropout_45 (Dropout)            (None, None, 256)    0           activation_84[0][0]              
__________________________________________________________________________________________________
separable_conv1d_101 (Separable (None, None, 256)    67584       dropout_45[0][0]                 
__________________________________________________________________________________________________
batch_normalization_101 (BatchN (None, None, 256)    1024        separable_conv1d_101[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_41 (Gl (None, 256)          0           batch_normalization_101[0][0]    
__________________________________________________________________________________________________
dense_85 (Dense)                (None, 16)           4112        global_average_pooling1d_41[0][0]
__________________________________________________________________________________________________
dense_86 (Dense)                (None, 256)          4352        dense_85[0][0]                   
__________________________________________________________________________________________________
reshape_41 (Reshape)            (None, 1, 256)       0           dense_86[0][0]                   
__________________________________________________________________________________________________
multiply_41 (Multiply)          (None, None, 256)    0           reshape_41[0][0]                 
                                                                 batch_normalization_101[0][0]    
__________________________________________________________________________________________________
add_41 (Add)                    (None, None, 256)    0           multiply_41[0][0]                
                                                                 activation_83[0][0]              
__________________________________________________________________________________________________
activation_85 (Activation)      (None, None, 256)    0           add_41[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_102 (Separable (None, None, 256)    67584       activation_85[0][0]              
__________________________________________________________________________________________________
batch_normalization_102 (BatchN (None, None, 256)    1024        separable_conv1d_102[0][0]       
__________________________________________________________________________________________________
activation_86 (Activation)      (None, None, 256)    0           batch_normalization_102[0][0]    
__________________________________________________________________________________________________
dropout_46 (Dropout)            (None, None, 256)    0           activation_86[0][0]              
__________________________________________________________________________________________________
separable_conv1d_103 (Separable (None, None, 256)    67584       dropout_46[0][0]                 
__________________________________________________________________________________________________
batch_normalization_103 (BatchN (None, None, 256)    1024        separable_conv1d_103[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_42 (Gl (None, 256)          0           batch_normalization_103[0][0]    
__________________________________________________________________________________________________
dense_87 (Dense)                (None, 16)           4112        global_average_pooling1d_42[0][0]
__________________________________________________________________________________________________
dense_88 (Dense)                (None, 256)          4352        dense_87[0][0]                   
__________________________________________________________________________________________________
reshape_42 (Reshape)            (None, 1, 256)       0           dense_88[0][0]                   
__________________________________________________________________________________________________
multiply_42 (Multiply)          (None, None, 256)    0           reshape_42[0][0]                 
                                                                 batch_normalization_103[0][0]    
__________________________________________________________________________________________________
add_42 (Add)                    (None, None, 256)    0           multiply_42[0][0]                
                                                                 activation_85[0][0]              
__________________________________________________________________________________________________
activation_87 (Activation)      (None, None, 256)    0           add_42[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_104 (Separable (None, None, 256)    67584       activation_87[0][0]              
__________________________________________________________________________________________________
batch_normalization_104 (BatchN (None, None, 256)    1024        separable_conv1d_104[0][0]       
__________________________________________________________________________________________________
activation_88 (Activation)      (None, None, 256)    0           batch_normalization_104[0][0]    
__________________________________________________________________________________________________
dropout_47 (Dropout)            (None, None, 256)    0           activation_88[0][0]              
__________________________________________________________________________________________________
separable_conv1d_105 (Separable (None, None, 256)    67584       dropout_47[0][0]                 
__________________________________________________________________________________________________
batch_normalization_105 (BatchN (None, None, 256)    1024        separable_conv1d_105[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_43 (Gl (None, 256)          0           batch_normalization_105[0][0]    
__________________________________________________________________________________________________
dense_89 (Dense)                (None, 16)           4112        global_average_pooling1d_43[0][0]
__________________________________________________________________________________________________
dense_90 (Dense)                (None, 256)          4352        dense_89[0][0]                   
__________________________________________________________________________________________________
reshape_43 (Reshape)            (None, 1, 256)       0           dense_90[0][0]                   
__________________________________________________________________________________________________
multiply_43 (Multiply)          (None, None, 256)    0           reshape_43[0][0]                 
                                                                 batch_normalization_105[0][0]    
__________________________________________________________________________________________________
add_43 (Add)                    (None, None, 256)    0           multiply_43[0][0]                
                                                                 activation_87[0][0]              
__________________________________________________________________________________________________
activation_89 (Activation)      (None, None, 256)    0           add_43[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_106 (Separable (None, None, 256)    67584       activation_89[0][0]              
__________________________________________________________________________________________________
batch_normalization_106 (BatchN (None, None, 256)    1024        separable_conv1d_106[0][0]       
__________________________________________________________________________________________________
activation_90 (Activation)      (None, None, 256)    0           batch_normalization_106[0][0]    
__________________________________________________________________________________________________
dropout_48 (Dropout)            (None, None, 256)    0           activation_90[0][0]              
__________________________________________________________________________________________________
separable_conv1d_107 (Separable (None, None, 256)    67584       dropout_48[0][0]                 
__________________________________________________________________________________________________
batch_normalization_107 (BatchN (None, None, 256)    1024        separable_conv1d_107[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_44 (Gl (None, 256)          0           batch_normalization_107[0][0]    
__________________________________________________________________________________________________
dense_91 (Dense)                (None, 16)           4112        global_average_pooling1d_44[0][0]
__________________________________________________________________________________________________
dense_92 (Dense)                (None, 256)          4352        dense_91[0][0]                   
__________________________________________________________________________________________________
reshape_44 (Reshape)            (None, 1, 256)       0           dense_92[0][0]                   
__________________________________________________________________________________________________
multiply_44 (Multiply)          (None, None, 256)    0           reshape_44[0][0]                 
                                                                 batch_normalization_107[0][0]    
__________________________________________________________________________________________________
add_44 (Add)                    (None, None, 256)    0           multiply_44[0][0]                
                                                                 activation_89[0][0]              
__________________________________________________________________________________________________
activation_91 (Activation)      (None, None, 256)    0           add_44[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_108 (Separable (None, None, 256)    67584       activation_91[0][0]              
__________________________________________________________________________________________________
batch_normalization_108 (BatchN (None, None, 256)    1024        separable_conv1d_108[0][0]       
__________________________________________________________________________________________________
activation_92 (Activation)      (None, None, 256)    0           batch_normalization_108[0][0]    
__________________________________________________________________________________________________
dropout_49 (Dropout)            (None, None, 256)    0           activation_92[0][0]              
__________________________________________________________________________________________________
separable_conv1d_109 (Separable (None, None, 256)    67584       dropout_49[0][0]                 
__________________________________________________________________________________________________
batch_normalization_109 (BatchN (None, None, 256)    1024        separable_conv1d_109[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_45 (Gl (None, 256)          0           batch_normalization_109[0][0]    
__________________________________________________________________________________________________
dense_93 (Dense)                (None, 16)           4112        global_average_pooling1d_45[0][0]
__________________________________________________________________________________________________
dense_94 (Dense)                (None, 256)          4352        dense_93[0][0]                   
__________________________________________________________________________________________________
reshape_45 (Reshape)            (None, 1, 256)       0           dense_94[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_110 (Separable (None, None, 256)    66048       activation_91[0][0]              
__________________________________________________________________________________________________
multiply_45 (Multiply)          (None, None, 256)    0           reshape_45[0][0]                 
                                                                 batch_normalization_109[0][0]    
__________________________________________________________________________________________________
batch_normalization_110 (BatchN (None, None, 256)    1024        separable_conv1d_110[0][0]       
__________________________________________________________________________________________________
add_45 (Add)                    (None, None, 256)    0           multiply_45[0][0]                
                                                                 batch_normalization_110[0][0]    
__________________________________________________________________________________________________
activation_93 (Activation)      (None, None, 256)    0           add_45[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_111 (Separable (None, None, 512)    132864      activation_93[0][0]              
__________________________________________________________________________________________________
batch_normalization_111 (BatchN (None, None, 512)    2048        separable_conv1d_111[0][0]       
__________________________________________________________________________________________________
activation_94 (Activation)      (None, None, 512)    0           batch_normalization_111[0][0]    
__________________________________________________________________________________________________
dropout_50 (Dropout)            (None, None, 512)    0           activation_94[0][0]              
__________________________________________________________________________________________________
separable_conv1d_112 (Separable (None, None, 512)    265216      dropout_50[0][0]                 
__________________________________________________________________________________________________
batch_normalization_112 (BatchN (None, None, 512)    2048        separable_conv1d_112[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_46 (Gl (None, 512)          0           batch_normalization_112[0][0]    
__________________________________________________________________________________________________
dense_95 (Dense)                (None, 32)           16416       global_average_pooling1d_46[0][0]
__________________________________________________________________________________________________
dense_96 (Dense)                (None, 512)          16896       dense_95[0][0]                   
__________________________________________________________________________________________________
reshape_46 (Reshape)            (None, 1, 512)       0           dense_96[0][0]                   
__________________________________________________________________________________________________
separable_conv1d_113 (Separable (None, None, 512)    131840      activation_93[0][0]              
__________________________________________________________________________________________________
multiply_46 (Multiply)          (None, None, 512)    0           reshape_46[0][0]                 
                                                                 batch_normalization_112[0][0]    
__________________________________________________________________________________________________
batch_normalization_113 (BatchN (None, None, 512)    2048        separable_conv1d_113[0][0]       
__________________________________________________________________________________________________
add_46 (Add)                    (None, None, 512)    0           multiply_46[0][0]                
                                                                 batch_normalization_113[0][0]    
__________________________________________________________________________________________________
activation_95 (Activation)      (None, None, 512)    0           add_46[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_114 (Separable (None, None, 512)    265216      activation_95[0][0]              
__________________________________________________________________________________________________
batch_normalization_114 (BatchN (None, None, 512)    2048        separable_conv1d_114[0][0]       
__________________________________________________________________________________________________
activation_96 (Activation)      (None, None, 512)    0           batch_normalization_114[0][0]    
__________________________________________________________________________________________________
dropout_51 (Dropout)            (None, None, 512)    0           activation_96[0][0]              
__________________________________________________________________________________________________
separable_conv1d_115 (Separable (None, None, 512)    265216      dropout_51[0][0]                 
__________________________________________________________________________________________________
batch_normalization_115 (BatchN (None, None, 512)    2048        separable_conv1d_115[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_47 (Gl (None, 512)          0           batch_normalization_115[0][0]    
__________________________________________________________________________________________________
dense_97 (Dense)                (None, 32)           16416       global_average_pooling1d_47[0][0]
__________________________________________________________________________________________________
dense_98 (Dense)                (None, 512)          16896       dense_97[0][0]                   
__________________________________________________________________________________________________
reshape_47 (Reshape)            (None, 1, 512)       0           dense_98[0][0]                   
__________________________________________________________________________________________________
multiply_47 (Multiply)          (None, None, 512)    0           reshape_47[0][0]                 
                                                                 batch_normalization_115[0][0]    
__________________________________________________________________________________________________
add_47 (Add)                    (None, None, 512)    0           multiply_47[0][0]                
                                                                 activation_95[0][0]              
__________________________________________________________________________________________________
activation_97 (Activation)      (None, None, 512)    0           add_47[0][0]                     
__________________________________________________________________________________________________
separable_conv1d_116 (Separable (None, None, 512)    265216      activation_97[0][0]              
__________________________________________________________________________________________________
batch_normalization_116 (BatchN (None, None, 512)    2048        separable_conv1d_116[0][0]       
__________________________________________________________________________________________________
activation_98 (Activation)      (None, None, 512)    0           batch_normalization_116[0][0]    
__________________________________________________________________________________________________
dropout_52 (Dropout)            (None, None, 512)    0           activation_98[0][0]              
__________________________________________________________________________________________________
separable_conv1d_117 (Separable (None, None, 512)    265216      dropout_52[0][0]                 
__________________________________________________________________________________________________
batch_normalization_117 (BatchN (None, None, 512)    2048        separable_conv1d_117[0][0]       
__________________________________________________________________________________________________
global_average_pooling1d_48 (Gl (None, 512)          0           batch_normalization_117[0][0]    
__________________________________________________________________________________________________
dense_99 (Dense)                (None, 32)           16416       global_average_pooling1d_48[0][0]
__________________________________________________________________________________________________
dense_100 (Dense)               (None, 512)          16896       dense_99[0][0]                   
__________________________________________________________________________________________________
reshape_48 (Reshape)            (None, 1, 512)       0           dense_100[0][0]                  
__________________________________________________________________________________________________
multiply_48 (Multiply)          (None, None, 512)    0           reshape_48[0][0]                 
                                                                 batch_normalization_117[0][0]    
__________________________________________________________________________________________________
add_48 (Add)                    (None, None, 512)    0           multiply_48[0][0]                
                                                                 activation_97[0][0]              
__________________________________________________________________________________________________
activation_99 (Activation)      (None, None, 512)    0           add_48[0][0]                     
__________________________________________________________________________________________________
dropout_53 (Dropout)            (None, None, 512)    0           activation_99[0][0]              
__________________________________________________________________________________________________
dense_101 (Dense)               (None, None, 256)    131328      dropout_53[0][0]                 
__________________________________________________________________________________________________
dropout_54 (Dropout)            (None, None, 256)    0           dense_101[0][0]                  
__________________________________________________________________________________________________
dense_102 (Dense)               (None, None, 1)      257         dropout_54[0][0]                 
==================================================================================================
Total params: 2,987,149
Trainable params: 2,969,229
Non-trainable params: 17,920
__________________________________________________________________________________________________
